---
kind: method
id: M:Autodesk.Revit.DB.DefinitionBindingMap.ForwardIterator
source: html/6a74cb96-740e-1b30-fbc0-91e45202e797.htm
---
# Autodesk.Revit.DB.DefinitionBindingMap.ForwardIterator Method

Retrieve a forward moving iterator to the map.

## Syntax (C#)
```csharp
public virtual DefinitionBindingMapIterator ForwardIterator()
```

## Returns
Returns a forward moving iterator to the map.